{"timestamp": "201511210912", "title": "Parsing", "content": "<p>A few years ago, I learned that parsing in computing is analyzing a consistently formatted language and compiling it into something more understandable for computers. A few days back, I learned that to parse in English is actually to split a sentence, and that kind of gave me an idea why parsing is called parsing in computing. But parsing kind of is still like splitting \"sentences\" in programming \"languages\"<br>Parsing a simple command in Python:<br>print(123 + random.randint(1, 10) * 5)<br>123 + random.randint(1, 10) * 5 becomes \"+\" \"123\" \"random.randint(1, 10) * 5\"<br>But \"random.randint(1, 10) * 5\" isn't done. We have to <b>iterate</b> to parse this unfinished result<br>\"random.randint(1, 10) * 5\" becomes \"*\" \"random.randint(1, 10)\" \"5\" but we're still not done! We need to finish \"random.randint(1, 10)\"<br>\"random.randint(1, 10)\" becomes \"random.randint\" \"1\" \"10\"<br><br>We just parsed Python code! It may be easy for humans, but hard for computers. Look at this parse tree of an English sentence :</p><img src=\"https://cloud.githubusercontent.com/assets/13187260/11319044/ea840ec6-9026-11e5-92b4-e93f551a3cfc.jpg\"><p>This would be very tough for a computer because I obviously looked all over that sentence to figure out its structure. This is usually the approach of a computer too: Split it continuously until you have the base words in categories like subject, verbs, nouns, adjectives, etc. This is why parsing English is so hard. We have to figure out ownership of verbs, adjectives, nouns, any words that are only owned by a specific noun or idea in the sentence. Even humans sometimes have trouble with this. As tjvr mentioned in <a href=\"http://tjvr.org/parsing-is-hard/\">Parsing is hard</a>, languages have to have <b>consistant</b> syntax. I can't just randomly choose if I want my adjectives and verbs before or after a noun. That would make some complications and someone may never know what I mean.<br>\"The sailed kickball purple up into the bright sky blue\" That is like a word scramble! You are vaguely able to get \"The purple kickball sailed up into the bright blue sky\", but what about a very complex sentence following my rules about?<br>\"The exploded bomb nuclear and left a cloud mushroom red giant. The was cloud mushroom so it big covered it the sky.\"<br>This is why syntax is so important. I can't just start using pipes as quotes in Python and still expect the interpreter to understand me.<br>print(\"hello\")<br>print(|hello|)<br><br>tjvr also mentioned that Python converts your syntax to a parse tree. This is easier than english because it has <b>formatting</b> in it's syntax.</p><img src=\"http://tjvr.org/img/Screenshot%202015-05-21%2018.45.59.png\"><p>That's about it. I'm off to try to parse simple English :P</p>"}