{"title": "Melody Generation vs Sentence Generation", "timestamp": "201603140932", "content": "Today, I had a thought. What are the biggest differences between melody generation and sentence generation. Sure, melody generation is the generation of melody, and sentence generation is the generation of sentences, but what exactly are some differences between the actual processes of the melody and sentence generation? I wrote some programs to do both. My melody generator was inspired by an internet friend (but not copied!).<br><br>It takes a key, and generates some notes (16, 24, 32, 40 or 48) along a major or minor scale (natural, not harmonic or melodic) of the key. It does this twice, getting two sequences of notes, both the same key and both either major or minor. It also makes sure that no semitones are played together when they're played in syncronization. Then it takes the first sequence, and loops it at 60bpm (so, quarter note = beat, 60 per minute), at the closest possible scale to middle C of its key. Then it takes the second sequence and plays it an octave lower at 30bpm (so, in half notes). Then it takes the second sequence again and plays it an octave higher than the higher sequence, at 120bpm (so, eigth notes. It will play the melody until all the instances of the melody end at the same time twice, then it will play a certain cadance based on whether it's major or minor, and the last note played.<br><br><b>The first thing I noticed while writing my sentence generator, was that sentences were a lot like melodies based on scales; you must have semitones on certain steps, you must have certain word types in certain places.</b><br>One difference I found was that sentences are more <i>conditional</i>. If you write one wrong word, you could mess up the whole sentence. Of course, you this could happen in melody, but it isn't as common of an issue. You're probably going to get an ok melody as long as you don't start hammering semitones.<br><br>My sentence generator was based on a list of regexes, with letters representing word types, and quoted text is exact. So / (\"That\" aa* n \"is\" v)/g would map to <br><br>\"That\" (any amount of ADJECTIVES) NOUN \"is\" VERB<br><br>Then, all the word types are filled in with random words of the specified type, so it could be<br> <br><span style=\"\"color:orange\"\">That</span> <span style=\"\"color:green\"\">crazy evil orange</span> <span style=\"\"color:red\"\">bear</span> <span style=\"\"color:orange\"\">is</span> <span style=\"\"color:yellow\"\">swimming</span>.<br><br><h3>Conclusion</h3><br>The biggest difference I found was that sentences are more demanding: they need the exact conditions to work right. Melody <i>can</i> be demanding, but not usually."}